AUTH_ERROR = 'Не удалось авторизироваться в Jira'
INCORRECT_ISSUE = 'Введите корректный номер задачи'
ISSUES_BY_WEEK_NOT_FOUND = 'Задач за неделю не найдено'
ISSUE_NOT_FOUND_F = 'Задача [{}] не найдена'
HOW_MUCH_TIME_DID_IT_TAKE = 'Сколько списать? Формат: 1d, 4h, 4h 30m, 1d 30m или 30m'
GREETING_F = 'Привет, {}'
YOU_WORKING_WITH = "За последнюю неделю вы работали над:"
BOT_CREATION_ERROR = 'Проверте файл конфигурации бота, особенно корректность токена'
WHAT_TASK_SHOULD_I_TRACK = "На какую задачу записать?"
TIME_LOGGED_SUCCESS = "Время успешно зарегистрировано 🎉🎉🎉"
TIME_LOGGED_FAILED = "Ошибка регистрации логирования времени"
ADD_COMMENT = "Напишите комментарий"
CURRENT_VERSION_F = "JiraBot v{}"
INCORRECT_WORKTIME = "Некорректное время"
PROCESS_HINT = "Наберите /status и следуйте указаниям"
PLEASE_REGISTRATION = "Вы не зарегистрированы, пожалуйста зарегистрируйтесь /start"
INFO_FOR_REGISTRATION_F = """Привет, {}
Для работы мне потребуются некоторые данные:
    * Домен вашей Jira например: https://yourcomanyname.atlassian.net
    * Email к которому привязан Jira аккаунт
    * Токен для доступа к Jira API: руководства: <a href='https://samarasoft.com/docs/connector-jira/configuration-integration/'>как получить?</a>, <a href='https://docs.searchunify.com/Content/Content-Sources/Atlassian-Jira-Confluence-Authentication-Create-API-Token.htm'>еще одно</a>
"""
GET_JIRA_SITE = "Пожалуйста🙏, введите домен Jira"
GET_JIRA_EMAIL = "Пожалуйста🙏, введите Ваш email привязанный к Jira "
GET_JIRA_TOKEN = "Пожалуйста🙏, введите Ваш Jira токен"
CREDENTIAL_ERROR = "Не удалось авторизирвоаться в Jira API, проверте свои данные и попробуйте ввести из снова. /start"
CREDENTIAL_OK = "Отлично Вы успешно зарегистровались. Приступим?😉 /status"
TRY_DELETE_NOT_REG_USER = "Хммм, уже уходите? А ведь вы даже не зарегистрировались😞"
ON_DELETE_USER = "Жаль расстоваться с Вами😢"
